spec/fixtures/vcr_cassettes/successful_refund.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/charges/ch_102o9Q2zE6DXCiQZ9beo1TTY
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.8.8
      Authorization:
      - Bearer sk_test_nyjKshCzw50unEHfPc5VzYE6
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.8.8","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-darwin12.3.0","publisher":"stripe","uname":"Darwin
        carbontoast.local 12.5.0 Darwin Kernel Version 12.5.0: Sun Sep 29 13:33:47
        PDT 2013; root:xnu-2050.48.12~1/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 29 Oct 2013 00:05:00 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1002'
      Connection:
      - keep-alive
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Credentials:
      - 'true'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_102o9Q2zE6DXCiQZ9beo1TTY",
          "object": "charge",
          "created": 1382555810,
          "livemode": false,
          "paid": true,
          "amount": 10000,
          "currency": "usd",
          "refunded": false,
          "card": {
            "id": "card_102o9Q2zE6DXCiQZq0Lqds9q",
            "object": "card",
            "last4": "4242",
            "type": "Visa",
            "exp_month": 10,
            "exp_year": 2015,
            "fingerprint": "Tkz6fHnLP9CR87PO",
            "customer": null,
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": "pass",
            "address_line1_check": null,
            "address_zip_check": null
          },
          "captured": true,
          "refunds": [],
          "balance_transaction": "txn_102o9Q2zE6DXCiQZBxZTOMnF",
          "failure_message": null,
          "failure_code": null,
          "amount_refunded": 0,
          "customer": null,
          "invoice": null,
          "description": "Baking Bread for toast@drtoast.com",
          "dispute": null,
          "metadata": {}
        }
    http_version: 
  recorded_at: Tue, 29 Oct 2013 00:05:00 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges/ch_102o9Q2zE6DXCiQZ9beo1TTY/refund
    body:
      encoding: US-ASCII
      string: amount=1000
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.8.8
      Authorization:
      - Bearer sk_test_nyjKshCzw50unEHfPc5VzYE6
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.8.8","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-darwin12.3.0","publisher":"stripe","uname":"Darwin
        carbontoast.local 12.5.0 Darwin Kernel Version 12.5.0: Sun Sep 29 13:33:47
        PDT 2013; root:xnu-2050.48.12~1/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '11'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 29 Oct 2013 00:05:01 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1182'
      Connection:
      - keep-alive
      Cache-Control:
      - no-cache, no-store
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_102o9Q2zE6DXCiQZ9beo1TTY",
          "object": "charge",
          "created": 1382555810,
          "livemode": false,
          "paid": true,
          "amount": 10000,
          "currency": "usd",
          "refunded": false,
          "card": {
            "id": "card_102o9Q2zE6DXCiQZq0Lqds9q",
            "object": "card",
            "last4": "4242",
            "type": "Visa",
            "exp_month": 10,
            "exp_year": 2015,
            "fingerprint": "Tkz6fHnLP9CR87PO",
            "customer": null,
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": "pass",
            "address_line1_check": null,
            "address_zip_check": null
          },
          "captured": true,
          "refunds": [
            {
              "amount": 1000,
              "currency": "usd",
              "created": 1383005101,
              "object": "refund",
              "balance_transaction": "txn_102q6C2zE6DXCiQZ5L8HFHN5"
            }
          ],
          "balance_transaction": "txn_102o9Q2zE6DXCiQZBxZTOMnF",
          "failure_message": null,
          "failure_code": null,
          "amount_refunded": 1000,
          "customer": null,
          "invoice": null,
          "description": "Baking Bread for toast@drtoast.com",
          "dispute": null,
          "metadata": {}
        }
    http_version: 
  recorded_at: Tue, 29 Oct 2013 00:05:01 GMT
recorded_with: VCR 2.6.0
